# –ì—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∞ –¥–∞–Ω–Ω—ã—Ö –∏ –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏

## –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞

–¢–∞–±–ª–∏—Ü—ã transactions –∏ customers –±—ã–ª–∏ —Å–æ–∑–¥–∞–Ω—ã —Ä–∞–Ω–µ–µ, –ø–æ—ç—Ç–æ–º—É —Ç–æ–ª—å–∫–æ –Ω–∞—Å—Ç—Ä–æ–∏–º –∫–æ–Ω–Ω–µ–∫—Ç–æ—Ä—ã

In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

import os
from dotenv import load_dotenv

import warnings
warnings.filterwarnings("ignore")

# –ö—Ä–µ–¥—ã –¥–ª—è –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è –∫ PostgreSQL. –ü–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –∏ –ø–∞—Ä–æ–ª—å –±–µ—Ä—ë–º –∏–∑ .env
user = os.getenv("POSTGRES_USER")
password = os.getenv("POSTGRES_PASSWORD")
host = "localhost"
port = 5432
database = "db1"

# –°–æ–∑–¥–∞—ë–º –¥–≤–∏–∂–æ–∫ –¥–ª—è —Ä–∞–±–æ—Ç—ã —Å –±–∞–∑–æ–π
engine = create_engine(f"postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}")

# –§—É–Ω–∫—Ü–∏—è –¥–ª—è —Å–æ–∑–¥–∞–Ω–∏—è —Å—Ö–µ–º –∏ —Ç–∞–±–ª–∏—Ü
def execute_query(sql):
    with engine.connect() as conection:
        try:
            conection.execute(text(sql))
            conection.commit()
            print("–ó–∞–ø—Ä–æ—Å —É—Å–ø–µ—à–Ω–æ –≤—ã–ø–æ–ª–Ω–µ–Ω! üéâüéâüéâ")
        except Exception as e:
            print(f"–ü—Ä–∏ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–∏ –∑–∞–ø—Ä–æ—Å–∞ –≤–æ–∑–Ω–∏–∫–ª–∞ –æ—à–∏–±–∫–∞: {e}")

## –ó–∞–¥–∞–Ω–∏–µ 1. –í—ã–≤–µ—Å—Ç–∏ —Ä–∞—Å–ø—Ä–µ–¥–µ–ª–µ–Ω–∏–µ (–∫–æ–ª–∏—á–µ—Å—Ç–≤–æ) –∫–ª–∏–µ–Ω—Ç–æ–≤ –ø–æ —Å—Ñ–µ—Ä–∞–º –¥–µ—è—Ç–µ–ª—å–Ω–æ—Å—Ç–∏, –æ—Ç—Å–æ—Ä—Ç–∏—Ä–æ–≤–∞–≤ —Ä–µ–∑—É–ª—å—Ç–∞—Ç –ø–æ —É–±—ã–≤–∞–Ω–∏—é –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞

In [2]:
# –í—ã–≤–æ–¥–∏–º –≤—Å–µ —Å—Ç—Ä–æ–∫–∏
pd.set_option('display.max_rows', 80)

sql = """
select
	job_industry_category,
	count(distinct customer_id) as users
from store_2.customers
group by 1
order by 2 desc
"""

pd.read_sql(sql, con=engine)

  job_industry_category  users
0         Manufacturing    799
1    Financial Services    774
2                  None    656
3                Health    602
4                Retail    358
5              Property    267
6                    IT    223
7         Entertainment    136
8           Argiculture    113
9    Telecommunications     72

## –ó–∞–¥–∞–Ω–∏–µ 2. –ù–∞–π—Ç–∏ —Å—É–º–º—É —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –∑–∞ –∫–∞–∂–¥—ã–π –º–µ—Å—è—Ü –ø–æ —Å—Ñ–µ—Ä–∞–º –¥–µ—è—Ç–µ–ª—å–Ω–æ—Å—Ç–∏, –æ—Ç—Å–æ—Ä—Ç–∏—Ä–æ–≤–∞–≤ –ø–æ –º–µ—Å—è—Ü–∞–º –∏ –ø–æ —Å—Ñ–µ—Ä–µ –¥–µ—è—Ç–µ–ª—å–Ω–æ—Å—Ç–∏

In [3]:
sql = """
select
	date_trunc('month', transaction_date) :: date as transaction_month,
	job_industry_category,
	count(distinct transaction_id) as transactions
from store_2.transactions as t
join store_2.customers as c on t.customer_id = c.customer_id
group by 1, 2
order by 1, 2
"""

pd.read_sql(sql, con=engine)

    transaction_month job_industry_category  transactions
0          2017-01-01           Argiculture            41
1          2017-01-01         Entertainment            58
2          2017-01-01    Financial Services           319
3          2017-01-01                Health           261
4          2017-01-01                    IT           100
..                ...                   ...           ...
115        2017-12-01         Manufacturing           299
116        2017-12-01              Property           117
117        2017-12-01                Retail           140
118        2017-12-01    Telecommunications            26
119        2017-12-01                  None           260

[120 rows x 3 columns]

## –ó–∞–¥–∞–Ω–∏–µ 3. –í—ã–≤–µ—Å—Ç–∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–Ω–ª–∞–π–Ω-–∑–∞–∫–∞–∑–æ–≤ –¥–ª—è –≤—Å–µ—Ö –±—Ä–µ–Ω–¥–æ–≤ –≤ —Ä–∞–º–∫–∞—Ö –ø–æ–¥—Ç–≤–µ—Ä–∂–¥–µ–Ω–Ω—ã—Ö –∑–∞–∫–∞–∑–æ–≤ –∫–ª–∏–µ–Ω—Ç–æ–≤ –∏–∑ —Å—Ñ–µ—Ä—ã IT

In [4]:
sql = """
select
	brand,
	count(distinct transaction_id) as transactions
from store_2.transactions as t
join store_2.customers as c on t.customer_id = c.customer_id
where 1 = 1
and online_order
and order_status = 'Approved'
and job_industry_category = 'IT'
group by 1
"""

pd.read_sql(sql, con=engine)

            brand  transactions
0  Giant Bicycles            89
1  Norco Bicycles            92
2      OHM Cycles            78
3           Solex           101
4   Trek Bicycles            82
5        WeareA2B            90
6            None             8

## –ó–∞–¥–∞–Ω–∏–µ 4. –ù–∞–π—Ç–∏ –ø–æ –≤—Å–µ–º –∫–ª–∏–µ–Ω—Ç–∞–º —Å—É–º–º—É –≤—Å–µ—Ö —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π (list_price), –º–∞–∫—Å–∏–º—É–º, –º–∏–Ω–∏–º—É–º –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π, –æ—Ç—Å–æ—Ä—Ç–∏—Ä–æ–≤–∞–≤ —Ä–µ–∑—É–ª—å—Ç–∞—Ç –ø–æ —É–±—ã–≤–∞–Ω–∏—é —Å—É–º–º—ã —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ –∫–ª–∏–µ–Ω—Ç–æ–≤. –í—ã–ø–æ–ª–Ω–∏—Ç–µ –¥–≤—É–º—è —Å–ø–æ—Å–æ–±–∞–º–∏: –∏—Å–ø–æ–ª—å–∑—É—è —Ç–æ–ª—å–∫–æ group by –∏ –∏—Å–ø–æ–ª—å–∑—É—è —Ç–æ–ª—å–∫–æ –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏. –°—Ä–∞–≤–Ω–∏—Ç–µ —Ä–µ–∑—É–ª—å—Ç–∞—Ç

In [5]:
# –ß–∏—Å—Ç—ã–π group by
sql = """
select
	customer_id,
	sum(list_price) as total_sum,
	min(list_price) min_sum,
	max(list_price) max_sum,
	count(transaction_id) as transactions
from store_2.transactions
group by customer_id
order by total_sum desc, transactions desc
"""

group_by = pd.read_sql(sql, con=engine)
group_by

      customer_id  total_sum  min_sum  max_sum  transactions
0            2183   19071.32   230.91  2005.66            14
1            1129   18349.27   290.62  1992.93            13
2            1597   18052.68   360.40  2091.47            12
3             941   17898.46  1057.51  2091.47            10
4            2788   17258.94   183.86  2083.94            11
...           ...        ...      ...      ...           ...
3489         2423     202.62   202.62   202.62             1
3490         3189     200.70   100.35   100.35             2
3491         2274     142.98    71.49    71.49             2
3492         2532      71.49    71.49    71.49             1
3493         3292      60.34    60.34    60.34             1

[3494 rows x 5 columns]

In [6]:
# –û–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏
sql = """
select distinct
	customer_id,
	sum(list_price) over(partition by customer_id) as total_sum,
	min(list_price) over(partition by customer_id) min_sum,
	max(list_price) over(partition by customer_id) max_sum,
	count(transaction_id) over(partition by customer_id) as transactions
from store_2.transactions
order by total_sum desc, transactions desc
"""

window = pd.read_sql(sql, con=engine)
window

      customer_id  total_sum  min_sum  max_sum  transactions
0            2183   19071.32   230.91  2005.66            14
1            1129   18349.27   290.62  1992.93            13
2            1597   18052.68   360.40  2091.47            12
3             941   17898.46  1057.51  2091.47            10
4            2788   17258.94   183.86  2083.94            11
...           ...        ...      ...      ...           ...
3489         2423     202.62   202.62   202.62             1
3490         3189     200.70   100.35   100.35             2
3491         2274     142.98    71.49    71.49             2
3492         2532      71.49    71.49    71.49             1
3493         3292      60.34    60.34    60.34             1

[3494 rows x 5 columns]

In [7]:
# –°—Ä–∞–≤–Ω–∏–≤–∞–µ–º —Ä–µ–∑—É–ª—å—Ç–∞—Ç—ã. –°–Ω–∞—á–∞–ª–∞ –∑–∞–¥–∞–¥–∏–º customer_id –≤ –∫–∞—á–µ—Å—Ç–≤–µ –∏–Ω–¥–µ–∫—Å–∞, —á—Ç–æ–±—ã —Å–≤–µ—Ä—è—Ç—å –ø–æ –∫–ª–∏–µ–Ω—Ç–∞–º
group_by = group_by.set_index("customer_id").sort_index()
window = window.set_index("customer_id").sort_index()
# –í—ã–≤–æ–¥–∏–º —Ç–æ–ª—å–∫–æ —Ç–µ —Å—Ç—Ä–æ–∫–∏, –∫–æ—Ç–æ—Ä—ã–µ –æ—Ç–ª–∏—á–∞—é—Ç—Å—è. round –¥–æ–±–∞–≤–ª—è–µ–º –∏–∑ - –∑–∞ –Ω–µ—Ç–æ—á–Ω–æ—Å—Ç–µ–π –æ–∫—Ä—É–≥–ª–µ–Ω–∏—è –ø—Ä–∏ –∞–≥—Ä–µ–≥–∞—Ü–∏–∏
group_by.round(2).compare(window.round(2), keep_equal=False)

Empty DataFrame
Columns: []
Index: []

–ö–∞–∫ –≤–∏–¥–∏–º, –≤—ã–≤–æ–¥ —á–µ—Ä–µ–∑ group by –∏ —á–µ—Ä–µ–∑ –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏ –∏–¥–µ–Ω—Ç–∏—á–µ–Ω (–ø—Ä–∏ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–∏ distinct)

## –ó–∞–¥–∞–Ω–∏–µ 5. –ù–∞–π—Ç–∏ –∏–º–µ–Ω–∞ –∏ —Ñ–∞–º–∏–ª–∏–∏ –∫–ª–∏–µ–Ω—Ç–æ–≤ —Å –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–π/–º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–π —Å—É–º–º–æ–π —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –∑–∞ –≤–µ—Å—å –ø–µ—Ä–∏–æ–¥ (—Å—É–º–º–∞ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –Ω–µ –º–æ–∂–µ—Ç –±—ã—Ç—å null). –ù–∞–ø–∏—à–∏—Ç–µ –æ—Ç–¥–µ–ª—å–Ω—ã–µ –∑–∞–ø—Ä–æ—Å—ã –¥–ª—è –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–π –∏ –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–π —Å—É–º–º—ã

In [8]:
# –ó–∞–ø—Ä–æ—Å –¥–ª—è –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–π —Å—É–º–º—ã
# –î–ª—è –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –Ω–∞—Ö–æ–¥–∏–º —Å—É–º–º—É —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏—è. –û—Å—Ç–∞–≤–ª—è–µ–º —Ç–æ–ª—å–∫–æ —Ç–µ customer_id, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—É–º–º–∞ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π —Ç–∞–∫–∞—è –∂–µ, –∫–∞–∫ –º–∞–∫—Å–∏–º–∞–ª—å–Ω–∞—è —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö
sql = """
with
max_sum as (
	select
		customer_id,
		max(transaction_sum) over() as max_sum_value,
		transaction_sum = max(transaction_sum) over() as was_max_sum
	from (
		select
			customer_id,
			sum(list_price) as transaction_sum
		from store_2.transactions
		group by 1
	)
)

select
	first_name,
	last_name,
	max_sum_value
from store_2.customers
join max_sum using (customer_id)
where was_max_sum
"""

pd.read_sql(sql, con=engine)

  first_name last_name  max_sum_value
0     Jillie    Fyndon       19071.32

In [9]:
# –ó–∞–ø—Ä–æ—Å –¥–ª—è –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–π —Å—É–º–º—ã
# –î–ª—è –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –Ω–∞—Ö–æ–¥–∏–º —Å—É–º–º—É —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏—è. –û—Å—Ç–∞–≤–ª—è–µ–º —Ç–æ–ª—å–∫–æ —Ç–µ customer_id, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—É–º–º–∞ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π —Ç–∞–∫–∞—è –∂–µ, –∫–∞–∫ –º–∏–Ω–∏–º–∞–ª—å–Ω–∞—è —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö
sql = """
with
min_sum as (
	select
		customer_id,
		min(transaction_sum) over() as min_sum_value,
		transaction_sum = min(transaction_sum) over() as was_min_sum
	from (
		select
			customer_id,
			sum(list_price) as transaction_sum
		from store_2.transactions
		group by 1
        having sum(list_price) IS NOT NULL
	)
)

select
	first_name,
	last_name,
	min_sum_value
from store_2.customers
join min_sum using (customer_id)
where was_min_sum
"""

pd.read_sql(sql, con=engine)

  first_name last_name  min_sum_value
0     Hamlen  Slograve          60.34

## –ó–∞–¥–∞–Ω–∏–µ 6. –í—ã–≤–µ—Å—Ç–∏ —Ç–æ–ª—å–∫–æ —Å–∞–º—ã–µ –ø–µ—Ä–≤—ã–µ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏ –∫–ª–∏–µ–Ω—Ç–æ–≤. –†–µ—à–∏—Ç—å —Å –ø–æ–º–æ—â—å—é –æ–∫–æ–Ω–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π

In [10]:
sql = """
select
--	distinct on (customer_id) -- —Ä–∞—Å–∫–æ–º–º–µ–Ω—Ç–∏—Ç—å, –µ—Å–ª–∏ –Ω—É–∂–Ω–æ –Ω–µ –±–æ–ª–µ–µ –æ–¥–Ω–æ–π —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏ –Ω–∞ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è
	*
from (
	select
		*,
		rank() over(partition by customer_id order by transaction_date) as r, -- –≤–∞—Ä–∏–∞–Ω
		min(transaction_date) over(partition by customer_id) as first_tr_date
	from store_2.transactions
)
where 1 = 1
-- AND r = 1
AND transaction_date = first_tr_date
order by customer_id, list_price DESC
"""

pd.read_sql(sql, con=engine)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,r,first_tr_date
0,9785,72,1,2017-01-05,False,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,1,2017-01-05
1,2261,1,2,2017-05-04,True,Approved,Giant Bicycles,Standard,medium,medium,1403.50,954.82,1,2017-05-04
2,10302,33,3,2017-02-23,False,Approved,Giant Bicycles,Standard,medium,small,1311.44,1167.18,1,2017-02-23
3,12441,95,4,2017-04-03,False,Approved,Giant Bicycles,Standard,medium,large,569.56,528.43,1,2017-04-03
4,2291,23,5,2017-03-03,True,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1,2017-03-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3515,8276,18,3497,2017-09-01,True,Approved,Solex,Standard,medium,medium,575.27,431.45,1,2017-09-01
3516,13469,12,3498,2017-02-03,True,Approved,WeareA2B,Standard,medium,medium,1231.15,161.60,1,2017-02-03
3517,2794,62,3499,2017-01-12,False,Approved,Solex,Standard,medium,medium,478.16,298.72,1,2017-01-12
3518,6309,69,3500,2017-01-09,True,Approved,Giant Bicycles,Road,medium,medium,792.90,594.68,1,2017-01-09
3519,17469,0,5034,2017-01-03,False,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,1,2017-01-03

## –ó–∞–¥–∞–Ω–∏–µ 7. –í—ã–≤–µ—Å—Ç–∏ –∏–º–µ–Ω–∞, —Ñ–∞–º–∏–ª–∏–∏ –∏ –ø—Ä–æ—Ñ–µ—Å—Å–∏–∏ –∫–ª–∏–µ–Ω—Ç–æ–≤, –º–µ–∂–¥—É —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏—è–º–∏ –∫–æ—Ç–æ—Ä—ã—Ö –±—ã–ª –º–∞–∫—Å–∏–º–∞–ª—å–Ω—ã–π –∏–Ω—Ç–µ—Ä–≤–∞–ª (–∏–Ω—Ç–µ—Ä–≤–∞–ª –≤—ã—á–∏—Å–ª—è–µ—Ç—Å—è –≤ –¥–Ω—è—Ö)

In [11]:
"""
–£—Å–ª–æ–≤–∏–µ –∑–∞–¥–∞–Ω–∏—è –Ω–µ —Å–æ–≤—Å–µ–º –ø–æ–Ω—è—Ç–Ω–æ, –ø–æ—ç—Ç–æ–º—É —É–∫–∞–∂—É –∫–∞–∫—É—é –∑–∞–¥–∞—á—É —Ä–µ—à–∞–µ—Ç –∑–∞–ø—Ä–æ—Å:
1) –î–ª—è –∫–∞–∂–¥–æ–≥–æ customer_id –Ω–∞—Ö–æ–¥–∏–º –∏–Ω—Ç–µ—Ä–≤–∞–ª –º–µ–∂–¥—É —Ç–µ–∫—É—â–µ–π –∏ –ø—Ä–µ–¥—ã–¥—É—â–µ–π —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–µ–π (–∫–æ–ª–æ–Ω–∫–∞ dt_interval)
2) –ò–∑ –≤—Å–µ—Ö –∏–Ω—Ç–µ—Ä–≤–∞–ª–æ–≤ –Ω–∞—Ö–æ–¥–∏–º –º–∞–∫—Å–∏–º–∞–ª—å–Ω—ã–π (–∫–æ–ª–æ–Ω–∫–∞ max_dt_interval)
3) –û—Å—Ç–∞–≤–ª—è–µ–º —Ç–æ–ª—å–∫–æ —Ç–µ customer_id, —É –∫–æ—Ç–æ—Ä—ã—Ö –∏–Ω—Ç–µ—Ä–≤–∞–ª —Ä–∞–≤–µ–Ω –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–º—É –∏–Ω—Ç–µ—Ä–≤–∞–ª—É —Å—Ä–µ–¥–∏ –∫–ª–∏–µ–Ω—Ç–æ–≤ (dt_interval = max_dt_interval)
4) –ü–æ —ç—Ç–∏–º customer_id –≤—ã–≤–æ–¥–∏–º –∏–º—è, —Ñ–∞–º–∏–ª–∏—é, –ø—Ä–æ—Ñ–µ—Å—Å–∏—é
"""

sql = """
select
	first_name,
	last_name,
	job_title
from store_2.customers
where customer_id in (
	select distinct
		customer_id
	from (
		select
			customer_id,
			dt_interval,
			max(dt_interval) over() as max_dt_interval
		from (
			select
				customer_id,
				transaction_date - lag(transaction_date) over(partition by customer_id order by transaction_date) as dt_interval
			from store_2.transactions
		)
	)
	where dt_interval = max_dt_interval
)
"""

pd.read_sql(sql, con=engine)

  first_name last_name        job_title
0  Susanetta      None  Legal Assistant